{
    "HOME": {
        "WELCOME_MAIN": "Welcome to my portfolio",
        "SECONDARY_TEXT": "Here you can find information about my projects, myself and how to contact me. Should you have any remarks, questions, suggestions or an offer, please do not hesitate to reach me.",
        "FULL_STACK_DEVELOPMENT": {
            "TITLE": "Full-Stack Development",
            "TEXT": "I specialize in building robust web applications from front-end to back-end using technologies like React, Node.js, and Next.js."
        },
        "CREATIVE_PROBLEM_SOLVING": {
            "TITLE": "Creative Problem Solving",
            "TEXT": "My passion lies in finding innovative solutions to complex challenges."
        },
        "USER_CENTERED_DESIGN": {
            "TITLE": "User-Centered Design",
            "TEXT": "I believe in designing with the user in mind, focusing on creating intuitive and engaging user experiences."
        },
        "CONTINUOUS_LEARNING": {
            "TITLE": "Continuous Learning",
            "TEXT": "Always eager to learn new technologies and techniques, I aim to stay up to date with the evolving tech landscape."
        },
        "COLLABORATION_TEAMWORK": {
            "TITLE": "Collaboration & Teamwork",
            "TEXT": "I thrive in collaborative environments, valuing open communication and shared goals to drive project success."
        },
        "PROFESSIONAL_GROWTH": {
            "TITLE": "Professional Growth",
            "TEXT": "My journey is focused on continuous improvement, seeking opportunities that challenge and expand my skillset."
        }
    },
    "PROJECTS": {
        "LOCAL_LOADING_TEXT": "Fetching my projects, please wait...",
        "MY_PROJECTS": "My projects",
        "TECHS_I_USE": "most of the technologies I currently use:",
        "MORE_PORJECTS_ON_GH": "You can also browse my GitHub repositories."
    },
    "ABOUT": {
        "HEADER": "About Me",
        "FIRST_PARAGRAPH": "Hello, I am Martin Bogdanov, a Web Developer primarily focused on Front-end development. I also enjoy working on Full Stack projects. My expertise includes JavaScript and TypeScript, complemented by a diverse set of technologies such as React, Next, Tailwind, SASS, GraphQL, NodeJS, Express, REST APIs, MongoDB, and more.",
        "SECOND_PARAGRAPH": "My journey in web development is driven by a commitment to critical thinking, dedication, and problem-solving, all of which allow me to tackle challenges and deliver successful outcomes. I am always enthusiastic about learning new technologies and advancing my career as a Front-end or Full-stack developer. Let us connect and explore opportunities to collaborate!"
    },
    "CONTACT": {
        "HEADER": "Contact me",
        "SEND_EMAIL_TEXT": "You can send me an e-mail by using this form.",
        "SEND_EMAIL_AFFIRMATION": "And I will make sure to look into it as soon as possible!"
    },
    "NAVIGATION": {
        "LOGO_TEXT": "M.B. Portfolio",
        "HOME": "Home",
        "PROJECTS": "Projects",
        "ABOUT": "About",
        "CONTACT": "Contact"
    },
    "FOOTER": {
        "HEADER": "Socials",
        "SECONDARY_TEXT": "I am happy to connect! You can find me on:",
        "SOCIAL_GITHUB": "GitHub",
        "SOCIAL_LINKEDIN": "LinkedIn"
    },
    "FORM": {
        "FIRST_NAME_LABEL": "First Name",
        "LAST_NAME_LABEL": "Last Name",
        "EMAIL_LABEL": "Email",
        "MESSAGE_LABEL": "Message",
        "LOADING_MESSAGE": "Transmitting message, please wait..."
    },
    "SERVER_ERROR": {
        "HEADER": "SORRY, SEEMS THE SERVER IS HAVING A BAD DAY",
        "SECONDARY_TEXT": "Please try again later!"
    },
    "NOT_FOUND": {
        "404": "404",
        "NOT_FOUND_TEXT": "Are you lost?",
        "BACK_TO_HOME": "Go Back Home"
    }
}
